УНФ_ТЕСТ/src/AccumulationRegisters/НДФЛРасчетыНалоговыхАгентовСБюджетом/НДФЛРасчетыНалоговыхАгентовСБюджетом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НДФЛРасчетыНалоговыхАгентовСБюджетом</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УНФ_ТЕСТ/src/AccumulationRegisters/НДФЛРасчетыНалоговыхАгентовСБюджетом/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда	
		Возврат;		
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	НДФЛРасчетыНалоговыхАгентовСБюджетом.НомерСтроки КАК НомерСтроки,
	|	НДФЛРасчетыНалоговыхАгентовСБюджетом.ВидДвижения КАК ВидДвижения,
	|	НДФЛРасчетыНалоговыхАгентовСБюджетом.Организация КАК Организация,
	|	НДФЛРасчетыНалоговыхАгентовСБюджетом.Сотрудник КАК Сотрудник,
	|	НДФЛРасчетыНалоговыхАгентовСБюджетом.ПериодРегистрации КАК ПериодРегистрации,
	|	НДФЛРасчетыНалоговыхАгентовСБюджетом.Сумма КАК СуммаПередЗаписью,
	|	НДФЛРасчетыНалоговыхАгентовСБюджетом.Сумма КАК СуммаИзменение,
	|	НДФЛРасчетыНалоговыхАгентовСБюджетом.Сумма КАК СуммаПриЗаписи
	|ПОМЕСТИТЬ ДвиженияНДФЛРасчетыНалоговыхАгентовСБюджетомИзменение
	|ИЗ
	|	РегистрНакопления.НДФЛРасчетыНалоговыхАгентовСБюджетом КАК НДФЛРасчетыНалоговыхАгентовСБюджетом");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияНДФЛРасчетыНалоговыхАгентовСБюджетомИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
